---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PipingConnectionType
source: html/01783174-50f9-4733-7bc5-f2f383ef89de.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PipingConnectionType Property

"Connection Type"

## Syntax (C#)
```csharp
public static ForgeTypeId PipingConnectionType { get; }
```